Feature: користувач шукає собі співбесідника
  Scenario 1: користувач відкриває розділ "Стрічка"
    Given користувач пролистує стрічку
  	When натикається роботу, що його зацікавила
   	And відкриває профіль автора роботи
  	And перегладяє його інші роботи
   	And бажає йому написати 
    Then пише йому повідомлення
    When інший користувач прочитав повідомлення 
    Then інший користувач відповідає на повідомлення
  Scenario 2: користувач відкриває розділ "Артисти"
    Given користувач бажає знайти аматора, хто цікаваться живописом
    When користувач вбиває у фільтр артистів дані про свого потенційного співбесідника, такі як вік, країна, мова, уподобання, рівень навичок
    Then приймає параметри фільтру через кнопку "шукати"
     And обирає собі потенційного співбесідника, виходячи з власної заінтересованості 
